{
    "title": "Desenvolvedor Front-End",
    "heroTitle": "Aprendizado contínuo por meio de resultados concretos",
    "heroSub": "Interfaces com foco em performance, clareza visual e boa experiência para usuários reais.",
    "heroBtnProjects": "Ver projetos",
    "heroBtnCV": "Baixar CV",
    "themeToDark": "Modo escuro",
    "themeToLight": "Modo claro",
    "about": "Sobre mim",
    "aboutText": "Sou desenvolvedor Front-end, entusiasta por transformar ideias em interfaces funcionais e atraentes. Tenho experiência prática com projetos pessoais e estudo constante de tecnologias modernas, com foco em React, JavaScript, HTML e CSS. Estou sempre em busca de aprender novas ferramentas e aplicar boas práticas de UI/UX para entregar resultados de qualidade. Tenho disciplina, curiosidade e disposição para enfrentar desafios e crescer junto com a equipe.",
    "skillsHTML": "HTML",
    "skillsCSS": "CSS",
    "skillsJS": "JavaScript",
    "skillsGit": "Git, GitHub",
    "skillsNode": "Node.js",
    "projects": "Projetos",
    "projectsTitle": "Projetos em Destaque",
    "projectsSubtitle": "Filtre por tecnologia e abra os detalhes para ver decisões técnicas de cada projeto.",
    "filterAll": "Todos",
    "filterHTML": "HTML",
    "filterCSS": "CSS",
    "filterJS": "JavaScript",
    "projectDetailsBtn": "Detalhes",
    "project1Name": "Conversor de Moedas R$ > US$",
    "project1Desc": "SPA que consome API de câmbio, valida inputs e formata valores em tempo real.",
    "project1Detail1": "Integração de API com tratamento de erros em falha de conexão.",
    "project1Detail2": "Validação de campos para evitar conversões inválidas.",
    "project1Detail3": "Formatação monetária com locale para melhorar leitura.",
    "project2Name": "Número Secreto (Game)",
    "project2Desc": "Jogo educativo em JavaScript, praticando manipulação de DOM, lógica e eventos de usuário.",
    "project2Detail1": "Sistema de tentativas com feedback imediato ao usuário.",
    "project2Detail2": "Lógica de comparação para orientar próximo palpite.",
    "project2Detail3": "Atualização de interface em tempo real sem recarregar a página.",
    "project3Name": "Cidade de Mentira",
    "project3Desc": "Página com layout responsivo e navegação dinâmica.",
    "project3Detail1": "Estrutura semântica organizada para leitura e manutenção.",
    "project3Detail2": "Responsividade ajustada para diferentes larguras de tela.",
    "project3Detail3": "Navegação simples com foco em fluidez de conteúdo.",
    "project4Name": "Mika Pets",
    "project4Desc": "Landing page responsiva para serviço de cuidados para cães, com design limpo e navegação intuitiva.",
    "project4Detail1": "Seções de conversão com CTA claro para contato rápido.",
    "project4Detail2": "Design adaptado para mobile com foco em legibilidade.",
    "project4Detail3": "Uso de JavaScript para interações leves e diretas.",
    "project5Name": "Projeto Android",
    "project5Desc": "Página temática sobre Android, explorando imagens e organização de conteúdo.",
    "project5Detail1": "Composição visual com hierarquia para texto e mídia.",
    "project5Detail2": "Layout modular para facilitar expansão de conteúdo.",
    "project5Detail3": "Atenção a espaçamento e contraste para leitura confortável.",
    "project6Name": "XAMPSBEATZ",
    "project6Desc": "Portfólio musical interativo para divulgação de beats, com foco em design minimalista e navegação fluida.",
    "project6Detail1": "Identidade visual centrada na marca pessoal e no conteúdo.",
    "project6Detail2": "Estrutura voltada para descoberta rápida de trabalhos.",
    "project6Detail3": "Interações discretas para reforçar experiência sem poluição.",
    "project1Demo": "Demo",
    "project1Code": "Código",
    "project2Demo": "Demo",
    "project2Code": "Código",
    "project3Demo": "Demo",
    "project3Code": "Código",
    "project4Demo": "Demo",
    "project4Code": "Código",
    "project5Demo": "Demo",
    "project5Code": "Código",
    "project6Demo": "Demo",
    "project6Code": "Código",
    "modalClose": "Fechar",
    "modalHighlights": "Destaques técnicos",
    "processTitle": "Processo",
    "processStep1Title": "1. Planejamento",
    "processStep1Text": "Defino objetivo, público e prioridades visuais para manter foco em resultado.",
    "processStep2Title": "2. Construção",
    "processStep2Text": "Desenvolvo estrutura responsiva, componentes reutilizáveis e interação clara.",
    "processStep3Title": "3. Refino e Publicação",
    "processStep3Text": "Valido acessibilidade, desempenho e ajusto detalhes para uma entrega profissional.",
    "curiosities": "Além do Código",
    "curiositiesText": "Produzo música nas horas vagas e aplico o mesmo cuidado criativo no desenvolvimento.",
    "curiositiesSkill": "Esse hábito fortalece minha atenção a ritmo, detalhe e consistência em interfaces.",
    "soundcloud": "Ouvir beats no SoundCloud",
    "youtube": "Ouvir no YouTube",
    "contact": "Contato",
    "footerSuffix": "Alexandre (Xan) Araujo - Desenvolvedor Front-End"
}
